tap "buo/cask-upgrade"               # Command to easily upgrade all cask installed apps
tap "caskroom/fonts"                 # Fonts installed via Homebrew cask
tap "heroku/brew"
tap "nodenv/nodenv"                  # Required for nodenv-package-json-engine
tap "thoughtbot/formulae"            # Required for parity and rcm

brew "bat"                           # Replacement for cat
brew "diff-so-fancy"                 # Make command-line git diffs much fancier
brew "elixir"
brew "exa"                           # Replacement for ls
brew "fish"
brew "fortune"                       # Dependency of Atom package fortune-background-tips
brew "fzf"
brew "git"
brew "gist"
brew "heroku"
brew "hub"
brew "httpie"
brew "libusb"                        # Requirement of wally keyboard flashing utility
brew "node-build"
brew "nodenv"
brew "nodenv-package-json-engine"    # Reads required node version from `package.json`
brew "rbenv"
brew "rcm"
brew "ripgrep"
brew "ruby-build"
brew "zsh"

# Cask fonts

cask "font-anka-coder"
cask "font-anonymous-pro"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-iosevka"
cask "font-source-code-pro"
