tap "buo/cask-upgrade"               # Command to easily upgrade all cask installed apps
tap "caskroom/fonts"                 # Fonts installed via Homebrew cask
tap "github/bootstrap"
tap "nodenv/nodenv"                  # Required for nodenv-package-json-engine
tap "thoughtbot/formulae"            # Required for parity and rcm
tap "spencercdixon/formulae"         # Required for exocortex

brew "ctags"
brew "diff-so-fancy"                 # Make command-line git diffs much fancier
brew "elixir"
brew "exocortex"                     # Personal wiki engine
brew "fish"
brew "fortune"                       # Dependency of Atom package fortune-background-tips
brew "fzf"
brew "git"
brew "gist"
brew "heroku-toolbelt"
brew "hub"
brew "httpie"
brew "mas"
brew "node-build"
brew "nodenv"
brew "nodenv-package-json-engine"    # Reads required node version from `package.json`
brew "parity"
brew "rbenv"
brew "rcm"
brew "ripgrep"
brew "ruby-build"
brew "rust"
brew "todo-txt"
brew "zsh"

# Cask apps

cask "keycastr"
cask "mojibar"                       # Emoji quick-reference menubar app

# Cask fonts

cask "font-anka-coder"
cask "font-anonymous-pro"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-iosevka"
cask "font-source-code-pro"

# Mac App Store apps

mas "1Password", id: 443987910
mas "Bear", id: 1091189122
mas "Gifwit", id: 871200983
mas "Textual 7", id: 1262957439
mas "Things3", id: 904280696
mas "Tweetbot", id: 557168941
mas "XCode", id: 497799835
