tap "buo/cask-upgrade"               # Command to easily upgrade all cask installed apps
tap "caskroom/fonts"                 # Fonts installed via Homebrew cask
tap "heroku/brew"
tap "thoughtbot/formulae"            # Required for rcm

brew "asdf"                          # Replacement for nodenv and rbenv
brew "autoconf"                      # Requirement for asdf erlang plugin
brew "bat"                           # Replacement for cat
brew "diff-so-fancy"                 # Make command-line git diffs much fancier
brew "exa"                           # Replacement for ls
brew "fish"
brew "fortune"                       # Dependency of Atom package fortune-background-tips
brew "fzf"                           # Command-line fuzzy matcher
brew "gh"
brew "git"
brew "gist"
brew "heroku"
brew "httpie"
brew "libusb"                        # Requirement of wally keyboard flashing utility
brew "rcm"
brew "ripgrep"
brew "wxmac"                         # Requirement for asdf erlang plugin

# Cask fonts

cask "font-anka-coder"
cask "font-anonymous-pro"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-iosevka"
cask "font-source-code-pro"
